const viChars = {
  a: ['a','à','á','ạ','ạ','ả','ã','â','ầ','ấ','ậ','ẩ','ẫ','ă','ằ','ắ','ắ','ặ','ẳ','ẵ'],
  e: ['e','è','é','ẹ','ẻ','ẽ','ê','ề','ế','ệ','ể','ễ'],
  i: ['i','ì','í','ị','ỉ','ĩ'],
  o: ['o','ò','ó','ọ','ọ','ỏ','õ','ô','ồ','ố','ộ','ổ','ỗ','ơ','ờ','ớ','ớ','ợ','ở','ỡ'],
  u: ['u','ù','ú','ụ','ủ','ũ','ư','ừ','ứ','ự','ử','ữ'],
  y: ['y','ỳ','ý','ỵ','ỷ','ỹ'],
  d: ['d','đ'],
  A: ['A','À','Á','Ạ','Ạ','Ả','Ã','Â','Ầ','Ấ','Ậ','Ẩ','Ẫ','Ă','Ằ','Ắ','Ắ','Ặ','Ẳ','Ẵ'],
  E: ['E','È','É','Ẹ','Ẻ','Ẽ','Ê','Ề','Ế','Ệ','Ể','Ễ'],
  I: ['I','Ì','Í','Ị','Ỉ','Ĩ'],
  O: ['O','Ò','Ó','Ọ','Ọ','Ỏ','Õ','Ô','Ồ','Ố','Ộ','Ổ','Ỗ','Ơ','Ờ','Ớ','Ớ','Ợ','Ở','Ỡ'],
  U: ['U','Ù','Ú','Ụ','Ủ','Ũ','Ư','Ừ','Ứ','Ự','Ử','Ữ'],
  Y: ['Y','Ỳ','Ý','Ỵ','Ỷ','Ỹ'],
  D: ['D','Đ'],
};

const map = new Map();
for (const key in viChars) {
  const chars: string[] = viChars[key];
  while (chars.length > 0) map.set(chars.pop(), key);
  delete viChars[key];
}

export const charmap = map;
